In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.52968219, -1.60758439,  0.82607771],
       [-0.95860112, -0.82766988,  0.21447538],
       [-0.97806717, -0.77130967,  1.1359879 ],
       [ 0.78759214,  1.00392119, -0.53514006]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0 -0.529682 -1.607584  0.826078
1 -0.958601 -0.827670  0.214475
2 -0.978067 -0.771310  1.135988
3  0.787592  1.003921 -0.535140

In [6]:
newDataFrame = pd.DataFrame(data, index = ["Zeynep","Büşra","Ali","Mehmet"], columns=["Maas","Yas","Calisma Saati"])

In [7]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep -0.529682 -1.607584       0.826078
Büşra  -0.958601 -0.827670       0.214475
Ali    -0.978067 -0.771310       1.135988
Mehmet  0.787592  1.003921      -0.535140

In [8]:
newDataFrame["Yas"]

Zeynep   -1.607584
Büşra    -0.827670
Ali      -0.771310
Mehmet    1.003921
Name: Yas, dtype: float64

In [9]:
newDataFrame["Calisma Saati"]

Zeynep    0.826078
Büşra     0.214475
Ali       1.135988
Mehmet   -0.535140
Name: Calisma Saati, dtype: float64

In [10]:
newDataFrame[["Maas","Yas"]]

            Maas       Yas
Zeynep -0.529682 -1.607584
Büşra  -0.958601 -0.827670
Ali    -0.978067 -0.771310
Mehmet  0.787592  1.003921

In [11]:
newDataFrame.loc["Mehmet"]

Maas             0.787592
Yas              1.003921
Calisma Saati   -0.535140
Name: Mehmet, dtype: float64

In [12]:
newDataFrame.loc["Büşra"]

Maas            -0.958601
Yas             -0.827670
Calisma Saati    0.214475
Name: Büşra, dtype: float64

In [13]:
newDataFrame.iloc[1]

Maas            -0.958601
Yas             -0.827670
Calisma Saati    0.214475
Name: Büşra, dtype: float64

In [14]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep -0.529682 -1.607584       0.826078
Büşra  -0.958601 -0.827670       0.214475
Ali    -0.978067 -0.771310       1.135988
Mehmet  0.787592  1.003921      -0.535140

In [15]:
newDataFrame["Maas"]

Zeynep   -0.529682
Büşra    -0.958601
Ali      -0.978067
Mehmet    0.787592
Name: Maas, dtype: float64

In [ ]:
newDataFrame["Emeklilik Yasi"] = newDataFrame